{
  "text1": {
    "original": "Today is our dragon boat festival, in our Chinese culture, to celebrate it with all safe and great in our lives. Hope you too, to enjoy it as my deepest wishes. Thank your message to show our words to  the doctor, as his next contract checking, to all of us. I got this message to see the approved message. In fact, I have received the message from  the professor, to show me, this, a couple of days ago.  I am very appreciated  the full support of the professor, for our Springer proceedings publication",
    "reference": "Today is the Dragon Boat Festival in our Chinese culture — a time to celebrate and wish safety and happiness in our lives. I hope you enjoy it as well; these are my sincerest wishes to you. Thank you for your message, which conveyed our words to the doctor as he prepares for his next contract review on behalf of all of us. I received this message to confirm the approved version. In fact, the professor had already shown it to me a couple of days ago. I truly appreciate the professor’s full support for our Springer proceedings publication.",
    "humarin": "Our Chinese culture celebrates today's dragon boat festival with the goal of celebrating with safety and greatness in our lives. May it be enjoyable for you as my thoughts are with you. As the doctor conducts his next contract check, thank you for your message to show us what we should say. The message was sent to me with the intention of viewing the authorized message. The professor sent me a message to show me this a few days ago. The professor's complete backing for our Springer proceedings is greatly appreciated.",
    "pegasus": "The dragon boat festival is celebrated in our Chinese culture and we should all be happy. Hope you enjoy it as much as I did. Thank you for your message, which will be shown to the doctor as his next contract checking. I saw the approved message after getting this message. I received the message from the professor a couple of days ago. The professor supported the Springer proceedings publication.",  
    "vamsi": "Today is our dragon boat festival in our Chinese culture to celebrate it in our lives safe and great. I also hope that you can enjoy it as my deepest wishes. Thanks for your message to show our words to the doctor, as his next contract checking, to all of us. This message arrived to see the approved message . I have received the message from the professor to show me this a couple of days ago .  I have very greatly appreciated the professor's full support for our publication of Springer proceedings.",
  },
  "text2": {
    "original": "During our final discuss, I told him about the new submission — the one we were waiting since last autumn, but the updates was confusing as it not included the full feedback from reviewer or maybe editor? Anyway, I believe the team, although bit delay and less communication at recent days, they really tried best for paper and cooperation. We should be grateful, I mean all of us, for the acceptance and efforts until the Springer link came finally last week, I think. Also, kindly remind me please, if the doctor still plan for the acknowledgments section edit before he sending again. Because I didn’t see that part final yet, or maybe I missed, I apologize if so. Overall, let us make sure all are safe and celebrate the outcome with strong coffee and future targets",
    "reference": "During our final discussion, I informed him about the new submission — the one we’ve been waiting on since last autumn — but the updates were confusing, as they didn’t include the complete feedback from the reviewer or perhaps the editor. Still, I believe the team, despite some delays and reduced communication in recent days, really tried their best regarding the paper and the collaboration. We should all be grateful for the acceptance and everyone’s efforts, which led to the Springer link finally arriving last week. Also, kindly remind me if the doctor still plans to revise the acknowledgments section before sending the document again. I didn’t see that part finalized — or maybe I missed it — and I apologize if that’s the case. Overall, let’s make sure everyone is safe and take a moment to celebrate the outcome with strong coffee and focus on our next goals.",
    "humarin": "During our last discussion, I shared with him the new submission we had been waiting for last autumn, but the changes were unclear as they did not provide full feedback from the reviewer or editor. Despite experiencing delays and less communication, the team did their best to achieve paper and collaboration, in my opinion. The acceptance and efforts made until the Springer link finally arrived are something we, as a group, should be grateful for. Please keep in mind that the doctor intends to revise the acknowledgments section before resending. Perhaps I didn't witness the final segment, but I'm sorry if that's the case. In the end, we must ensure that everyone is secure and mark the occasion with scrumptious coffee and ambitious goals.",
    "pegasus": "I told him about the new submission we were waiting for, but the updates were confusing as they did not include the full feedback from the reviewer or editor. I think the team tried their best for paper and cooperation despite the recent delay and less communication. We should be thankful for the acceptance and efforts until the Springer link came last week, I think. If the doctor still plans for the acknowledgments section to be edited before he sends again, please remind me. I apologize if I missed that part final. Let's make sure all are safe and celebrate the outcome with coffee and targets.",
    "vamsi": "During the final discussion I told him about the new submission — the one that we had waited on since last fall , but the updates were confusing as it did not include the full feedback from reviewer or maybe editor ? I believe the team actually tried better for the paper and for cooperation, although bit delay and less communication in recent days .  For the acceptance and efforts we all should be grateful, I think , until the Springer link finally came last week. Also kindly remind me if the doctor still plan for the acknowledgments section before sending it again. Because I didn’t see this part final yet, or maybe I missed it, I will apologize if so. Let us ensure that all are safe and celebrate the outcome with strong coffee and future targets ."
  }
}